import React from "react";
import { AboutContainer } from "../styles/about.styles";
import { Space, List, Typography, Divider } from "antd";

const data_Condition = [
  "تتعهد جيزة أبس بالحفاظ على سرية بيانات العمالء و عدم نشرها أو استخدامها أو عرضها ،إلا في حالة المسألة القانونية.",
  "قبل قيامك بشراء اي من خدمات الطرف الثاني يجب ان يطلع الطرف األول جيدا على الشروط واالحكام و تفاصيل ومواصفات طلبه، وموافق على استالم ما تم ذكره وكتابته في العقد المبرم مع االتفاقية ولن يتم تنفيذ أو تقديم أي خدمة أو إضافة أو برمجة أو ميزة أو هدية لم تذكروتكتب في هذه االتفاقية وال يعتد باي مواصفات شفهية.",
  "يلتزم الطرف الثاني ) الشركة المطورة ( بااللتزام الكامل بمواصفات التطبيق المرسلة بملف التحليل الفني والمواصفات المستلمة من العميل وااللتزام بتسليم التطبيق بكفاءة عالية وآداء سهل الاستخدام.",
  "تعتبر هذه االتفاقية هو وثيقة التعاقد بين الطرف االول )العميل صاحب الخدمة( والطرف الثاني ' جيزة أبس' ، وال يحق للطرف اآلول المطالبة باي مزايا أو اضافات لم تذكر في هذا العقد أو االتفاقية، إال بعد االتفاق عليها بسعر ووقت اضافي في حالة توفر إمكانية تنفيذها من خالل الطرف الثاني وقبوله بتنفيذها واضافتها كملحق اضافي موقع عليه من قبل الطرفين أو ببريد رسمي.",
  "يراعي متابعة العميل ) الطرف األول ( ارسال المالحظات الفنية للشركة المطورة بشكل سريع وفي نطاق المهلة المحددة من الطرف االول حتي ال يتعذر تسليم المشروع.",
  "يتم احتساب مهلة أقصاها 20 يوماً آلرسال العميل كافة مالحظاته التي تخص عمل التطبيق بشكل كامل و جيد بعد تسليم المشروع بشكل كامل وحين تجاوز هذه المدة من خالل العميل يعامل المشروع من خاللنا علي انه تم تسليمه بشكل كامل دون مشاكل دون أي مستحقات علي في هيكلية المشروع األساسية الطرف الثاني، في ماعدا أي خطآ برمجي قد يحدث الحق.",
  "في حالة تآخير ارسال أي عمليات جيزة أبس لطرف ثالث مثل بوابات الدفع / الرسائل اثناء العمل علي المشروع يحق للطرف الثاني إسترداد باقي دفعات المشروع كاملة مع آلتزامه الكامل أمام العميل كشركة مطورة بربطها في حين استالمها بدون أي مقابل أو تكاليف إضافية علي العميل.",
  "ال يمكن استخدام اي خدمة تم تطويرها بواسطة 'جيزة أبس' فيما يسئ لإلسالم أو اي محتويات مخلة باآلداب أو بالقانون مثل التجريح في شخصيات خاصة أو عامة، أو ذكر الفاظ غير الئقة في حق اي شخص، وذلك حفاظا الحقوق المدنية لكل شخص. وفي حال مخالفة هذا البند تخلي ' رجيزة أبس ' مسؤليتها عن ذلك ولها الحق في ايقاف الخدمة فورا دون الرجوع للطرف األول دون ادني تعويض وال يتحمل الطرف الثاني اي مسئولية ناتجة عن أي استخدام خاطئ أو مخالف للقوانين المحلية والدولية.",
  " .جيزة أبس' غير مسئولة عن اي عمليات أو اتفاقيات تتم خارج ارقام الهواتف أو عناوين البريد االلكتروني الموضحة في موقعنا وعقودنا أو مقرنا الرسمي الموضح بالموقع الرسمي'.",
  "كافة تكاليف المشروعات التي تقوم بها ' جيزة أبس' غير شامله مصاريف التحويل أو الضرائب المخصومة، لذلك يتحمل العميل مصاريف التحويل وقيمة الضرائب.",
  "ال تقدم ”جيزة أبس' ' سياسة استرداد المبالغ أو الدفعات المحولة حيث انها تصرف دوما مقدما ويصعب اعادة المبلغ للعميل، ويستثني من ذلك الحاالت التي توضح فيها ' جيزة أبس ' بشكل مكتوب امكانية استرداد المبالغ.",
  "ال اعادة استرداد بمجرد التوقيع عل هذه االتفاقية أو تحويل الدفعة االولي من المبلغ المتفق عليه تعتبر موافقة تامة من قبل الطرف االول و الثاني علي جميع المواصفات الفنية وشروط الخدمة المتفق عليها و المكتوبة في هذه االتفاقية و ال يعتد باي مواصفات أو طلبات أو شروط غير مكتوبة أو محددة في هذه االتفاقية",
  "تتعهد جيزة أبس بالحفاظ على سرية بيانات العمالء و عدم نشرها أو استخدامها أو عرضها ،إلا في حالة المسألة القانونية.",
  "قبل قيامك بشراء اي من خدمات الطرف الثاني يجب ان يطلع الطرف األول جيدا على الشروط واالحكام و تفاصيل ومواصفات طلبه، وموافق على استالم ما تم ذكره وكتابته في العقد المبرم مع االتفاقية ولن يتم تنفيذ أو تقديم أي خدمة أو إضافة أو برمجة أو ميزة أو هدية لم تذكروتكتب في هذه االتفاقية وال يعتد باي مواصفات شفهية.",
  "يلتزم الطرف الثاني ) الشركة المطورة ( بااللتزام الكامل بمواصفات التطبيق المرسلة بملف التحليل الفني والمواصفات المستلمة من العميل وااللتزام بتسليم التطبيق بكفاءة عالية وآداء سهل الاستخدام.",
  "تعتبر هذه االتفاقية هو وثيقة التعاقد بين الطرف االول )العميل صاحب الخدمة( والطرف الثاني ' جيزة أبس' ، وال يحق للطرف اآلول المطالبة باي مزايا أو اضافات لم تذكر في هذا العقد أو االتفاقية، إال بعد االتفاق عليها بسعر ووقت اضافي في حالة توفر إمكانية تنفيذها من خالل الطرف الثاني وقبوله بتنفيذها واضافتها كملحق اضافي موقع عليه من قبل الطرفين أو ببريد رسمي.",
  "يراعي متابعة العميل ) الطرف األول ( ارسال المالحظات الفنية للشركة المطورة بشكل سريع وفي نطاق المهلة المحددة من الطرف االول حتي ال يتعذر تسليم المشروع.",
  "يتم احتساب مهلة أقصاها 20 يوماً آلرسال العميل كافة مالحظاته التي تخص عمل التطبيق بشكل كامل و جيد بعد تسليم المشروع بشكل كامل وحين تجاوز هذه المدة من خالل العميل يعامل المشروع من خاللنا علي انه تم تسليمه بشكل كامل دون مشاكل دون أي مستحقات علي في هيكلية المشروع األساسية الطرف الثاني، في ماعدا أي خطآ برمجي قد يحدث الحق.",
  "في حالة تآخير ارسال أي عمليات جيزة أبس لطرف ثالث مثل بوابات الدفع / الرسائل اثناء العمل علي المشروع يحق للطرف الثاني إسترداد باقي دفعات المشروع كاملة مع آلتزامه الكامل أمام العميل كشركة مطورة بربطها في حين استالمها بدون أي مقابل أو تكاليف إضافية علي العميل.",
  "ال يمكن استخدام اي خدمة تم تطويرها بواسطة 'جيزة أبس' فيما يسئ لإلسالم أو اي محتويات مخلة باآلداب أو بالقانون مثل التجريح في شخصيات خاصة أو عامة، أو ذكر الفاظ غير الئقة في حق اي شخص، وذلك حفاظا الحقوق المدنية لكل شخص. وفي حال مخالفة هذا البند تخلي ' رجيزة أبس ' مسؤليتها عن ذلك ولها الحق في ايقاف الخدمة فورا دون الرجوع للطرف األول دون ادني تعويض وال يتحمل الطرف الثاني اي مسئولية ناتجة عن أي استخدام خاطئ أو مخالف للقوانين المحلية والدولية.",
  " .جيزة أبس' غير مسئولة عن اي عمليات أو اتفاقيات تتم خارج ارقام الهواتف أو عناوين البريد االلكتروني الموضحة في موقعنا وعقودنا أو مقرنا الرسمي الموضح بالموقع الرسمي'.",
  "كافة تكاليف المشروعات التي تقوم بها ' جيزة أبس' غير شامله مصاريف التحويل أو الضرائب المخصومة، لذلك يتحمل العميل مصاريف التحويل وقيمة الضرائب.",
  "ال تقدم ”جيزة أبس' ' سياسة استرداد المبالغ أو الدفعات المحولة حيث انها تصرف دوما مقدما ويصعب اعادة المبلغ للعميل، ويستثني من ذلك الحاالت التي توضح فيها ' جيزة أبس ' بشكل مكتوب امكانية استرداد المبالغ.",
  "ال اعادة استرداد بمجرد التوقيع عل هذه االتفاقية أو تحويل الدفعة االولي من المبلغ المتفق عليه تعتبر موافقة تامة من قبل الطرف االول و الثاني علي جميع المواصفات الفنية وشروط الخدمة المتفق عليها و المكتوبة في هذه االتفاقية و ال يعتد باي مواصفات أو طلبات أو شروط غير مكتوبة أو محددة في هذه االتفاقية",
];

const tec_Support =[
    "يلتزم الطرف الثاني ) الشركة المطورة ( بااللتزام الكامل بمواصفات التطبيق المرسلة بملف التحليل الفني والمواصفات المستلمة من العميل وااللتزام بتسليم التطبيق بكفاءة عالية وآداء سهل الاستخدام.",
    "تعتبر هذه االتفاقية هو وثيقة التعاقد بين الطرف االول )العميل صاحب الخدمة( والطرف الثاني ' جيزة أبس' ، وال يحق للطرف اآلول المطالبة باي مزايا أو اضافات لم تذكر في هذا العقد أو االتفاقية، إال بعد االتفاق عليها بسعر ووقت اضافي في حالة توفر إمكانية تنفيذها من خالل الطرف الثاني وقبوله بتنفيذها واضافتها كملحق اضافي موقع عليه من قبل الطرفين أو ببريد رسمي.",
    "يراعي متابعة العميل ) الطرف األول ( ارسال المالحظات الفنية للشركة المطورة بشكل سريع وفي نطاق المهلة المحددة من الطرف االول حتي ال يتعذر تسليم المشروع.",
    "يتم احتساب مهلة أقصاها 20 يوماً آلرسال العميل كافة مالحظاته التي تخص عمل التطبيق بشكل كامل و جيد بعد تسليم المشروع بشكل كامل وحين تجاوز هذه المدة من خالل العميل يعامل المشروع من خاللنا علي انه تم تسليمه بشكل كامل دون مشاكل دون أي مستحقات علي في هيكلية المشروع األساسية الطرف الثاني، في ماعدا أي خطآ برمجي قد يحدث الحق.",
    "في حالة تآخير ارسال أي عمليات جيزة أبس لطرف ثالث مثل بوابات الدفع / الرسائل اثناء العمل علي المشروع يحق للطرف الثاني إسترداد باقي دفعات المشروع كاملة مع آلتزامه الكامل أمام العميل كشركة مطورة بربطها في حين استالمها بدون أي مقابل أو تكاليف إضافية علي العميل.",
    "ال يمكن استخدام اي خدمة تم تطويرها بواسطة 'جيزة أبس' فيما يسئ لإلسالم أو اي محتويات مخلة باآلداب أو بالقانون مثل التجريح في شخصيات خاصة أو عامة، أو ذكر الفاظ غير الئقة في حق اي شخص، وذلك حفاظا الحقوق المدنية لكل شخص. وفي حال مخالفة هذا البند تخلي ' رجيزة أبس ' مسؤليتها عن ذلك ولها الحق في ايقاف الخدمة فورا دون الرجوع للطرف األول دون ادني تعويض وال يتحمل الطرف الثاني اي مسئولية ناتجة عن أي استخدام خاطئ أو مخالف للقوانين المحلية والدولية.",
    " .جيزة أبس' غير مسئولة عن اي عمليات أو اتفاقيات تتم خارج ارقام الهواتف أو عناوين البريد االلكتروني الموضحة في موقعنا وعقودنا أو مقرنا الرسمي الموضح بالموقع الرسمي'.",
   
]

const work_duration = [
    "قبل قيامك بشراء اي من خدمات الطرف الثاني يجب ان يطلع الطرف األول جيدا على الشروط واالحكام و تفاصيل ومواصفات طلبه، وموافق على استالم ما تم ذكره وكتابته في العقد المبرم مع االتفاقية ولن يتم تنفيذ أو تقديم أي خدمة أو إضافة أو برمجة أو ميزة أو هدية لم تذكروتكتب في هذه االتفاقية وال يعتد باي مواصفات شفهية.",
  "يلتزم الطرف الثاني ) الشركة المطورة ( بااللتزام الكامل بمواصفات التطبيق المرسلة بملف التحليل الفني والمواصفات المستلمة من العميل وااللتزام بتسليم التطبيق بكفاءة عالية وآداء سهل الاستخدام.",
  "تعتبر هذه االتفاقية هو وثيقة التعاقد بين الطرف االول )العميل صاحب الخدمة( والطرف الثاني ' جيزة أبس' ، وال يحق للطرف اآلول المطالبة باي مزايا أو اضافات لم تذكر في هذا العقد أو االتفاقية، إال بعد االتفاق عليها بسعر ووقت اضافي في حالة توفر إمكانية تنفيذها من خالل الطرف الثاني وقبوله بتنفيذها واضافتها كملحق اضافي موقع عليه من قبل الطرفين أو ببريد رسمي.",
  "يراعي متابعة العميل ) الطرف األول ( ارسال المالحظات الفنية للشركة المطورة بشكل سريع وفي نطاق المهلة المحددة من الطرف االول حتي ال يتعذر تسليم المشروع.",
  "يتم احتساب مهلة أقصاها 20 يوماً آلرسال العميل كافة مالحظاته التي تخص عمل التطبيق بشكل كامل و جيد بعد تسليم المشروع بشكل كامل وحين تجاوز هذه المدة من خالل العميل يعامل المشروع من خاللنا علي انه تم تسليمه بشكل كامل دون مشاكل دون أي مستحقات علي في هيكلية المشروع األساسية الطرف الثاني، في ماعدا أي خطآ برمجي قد يحدث الحق.",
  "في حالة تآخير ارسال أي عمليات جيزة أبس لطرف ثالث مثل بوابات الدفع / الرسائل اثناء العمل علي المشروع يحق للطرف الثاني إسترداد باقي دفعات المشروع كاملة مع آلتزامه الكامل أمام العميل كشركة مطورة بربطها في حين استالمها بدون أي مقابل أو تكاليف إضافية علي العميل.",
  "ال يمكن استخدام اي خدمة تم تطويرها بواسطة 'جيزة أبس' فيما يسئ لإلسالم أو اي محتويات مخلة باآلداب أو بالقانون مثل التجريح في شخصيات خاصة أو عامة، أو ذكر الفاظ غير الئقة في حق اي شخص، وذلك حفاظا الحقوق المدنية لكل شخص. وفي حال مخالفة هذا البند تخلي ' رجيزة أبس ' مسؤليتها عن ذلك ولها الحق في ايقاف الخدمة فورا دون الرجوع للطرف األول دون ادني تعويض وال يتحمل الطرف الثاني اي مسئولية ناتجة عن أي استخدام خاطئ أو مخالف للقوانين المحلية والدولية.",
  " .جيزة أبس' غير مسئولة عن اي عمليات أو اتفاقيات تتم خارج ارقام الهواتف أو عناوين البريد االلكتروني الموضحة في موقعنا وعقودنا أو مقرنا الرسمي الموضح بالموقع الرسمي'.",
  "كافة تكاليف المشروعات التي تقوم بها ' جيزة أبس' غير شامله مصاريف التحويل أو الضرائب المخصومة، لذلك يتحمل العميل مصاريف التحويل وقيمة الضرائب.",
  "ال تقدم ”جيزة أبس' ' سياسة استرداد المبالغ أو الدفعات المحولة حيث انها تصرف دوما مقدما ويصعب اعادة المبلغ للعميل، ويستثني من ذلك الحاالت التي توضح فيها ' جيزة أبس ' بشكل مكتوب امكانية استرداد المبالغ.",

]

const terms = () => {
  return (
    <AboutContainer style={{ margin: "88px 0px 130px 0px"}}>
      <div className="row-container">
        <Space size={"large"} direction="vertical">
          <div style={{ margin: "72px 0 83px 0" }}>
              <h1 className="intro-header" style={{border: "none"}}>الشروط والاحكام</h1>
          </div>
          <Typography className="term-header">
            من أجل رفع مستوى خدمتك التي نؤمن بها مبدأ الشفافية المدرجة أدناه هي
            اتفاقية الاستخدام ، والتي تحدد الشروط عقد بين العميل (الطرف الأول)
            وشركة جيزه أبس (الطرف الثاني)
          </Typography>
          <List
            size="large"
            header={<div className="term-detail-header">الشروط العامة</div>}         
            dataSource={data_Condition}
            renderItem={(item) => <List.Item>{item}</List.Item>}
          />
          <List
            size="large"
            header={<div className="term-detail-header">مدة العمل</div>}         
            dataSource={work_duration}
            renderItem={(item) => <List.Item>{item}</List.Item>}
          />
          <List
            size="large"
            header={<div className="term-detail-header">الدعم الفنى</div>}         
            dataSource={tec_Support}
            renderItem={(item) => <List.Item>{item}</List.Item>}
          />
        </Space>
      </div>
    </AboutContainer>
  );
};

export default terms;
